{
  "home": {
    "welcome": "Cześć! Jestem",
    "workTitle": "Software Engineer"
  },
  "menu": {
    "profile": "Profil",
    "aboutMe": "O mnie",
    "education": "Edukacja",
    "professionalExperience": "Doświadczenie zawodowe",
    "courses": "Szkolenia/Certyfikaty",
    "skills": "Umiejętności"
  },
  "profile": {
    "description": "Jestem absolwentem studiów magisterskich na kierunku informatyka (z wyróżnieniem) na Politechnice Śląskiej, specjalizującym się w inżynierii danych i systemów. Pracuję jako programista Full-Stack w Asseco Poland, dostarczając funkcje internetowe i backendowe przy użyciu TypeScript (Angular), Java (Spring / Spring Boot) oraz relacyjnych baz danych (PostgreSQL, Oracle).\n\n Moje główne zainteresowania obejmują tworzenie niezawodnych, kontenerowych i obserwowalnych platform — zwłaszcza Kubernetes, architektur natywnych dla chmury, mikrousług i potoków przetwarzania danych. Lubię projektować przejrzyste granice usług, integrować bramki komunikacyjne i API oraz poprawiać wydajność i łatwość konserwacji poprzez automatyzację i dobre praktyki inżynieryjne.\n\nCenię pragmatyczne podejście do inżynierii: mierzenie przed optymalizacją, pisanie łatwego w utrzymaniu kodu oraz współpracę w zespołach Agile / Scrum. Obecnie poszerzam swoją wiedzę w zakresie operacji Kubernetes i zaawansowanych wzorców platform chmurowych.\n\nZawsze jestem otwarty na ambitne wyzwania z pogranicza inżynierii oprogramowania, infrastruktury i systemów intensywnie przetwarzających dane.\n\nStaram się poszerzać swoją wiedzę, biorąc udział w różnych szkoleniach i egzaminach certyfikacyjnych, aby jeszcze bardziej pogłębiać swój ciągły rozwój technologiczny."
  },
  "education": {
    "university": "Uczelnia i wydział",
    "field": "Kierunek",
    "techStack": "Stack technologiczny",
    "specialization": "Specjalizacja",
    "period": "Okres studiów",
    "rating": "Średnia ocen",
    "sileasianUniversityOfTechnology": "Politechnika Śląska",
    "faculty": "wydział",
    "automaticElectronicsAndComputerScience": "Automatyki, Elektroniki i Informatyki",
    "databasesAndSystemsEngineering": "Bazy danych i inżynieria systemów",
    "dataAndSystemsEngineering": "Inżynieria Danych i Systemów",
    "computerScience": "Informatyka",
    "engineer": "Inżynier",
    "engineerDescription": "Kierunek studiów jest przeznaczony dla osób zainteresowanych elektroniką i informatyką, które wiążą z nimi swoją przyszłość. Osobiście zdobyłem wiele cennych informacji, które pozwoliły mi się rozwinąć i zachęciły do nauki nowych technologii w dziedzinie informatyki.",
    "master": "Magister",
    "masterDescription": "Program studiów poświęcony jest w szczególności przedmiotom, które zapewniają umiejętności w zakresie analizy i przetwarzania danych przy użyciu narzędzi opartych na różnych modelach danych, sztucznej inteligencji,\ngłębokim uczeniu się oraz zasobach chmury i platformach Big Data. W ramach tego kursu uczestnicy poznają również różne platformy przetwarzania w chmurze oraz nowe paradygmaty\ntworzenia skalowalnego, rozszerzalnego i dostępnego globalnie oprogramowania.",
    "engineerProject": "Aplikacja monitorująca obszary",
    "engineerProjectDescription": "Projekt jest aplikacją do monitorowania obszarów. Architektura aplikacji oparta jest na architekturze mikrousług z komunikacją między serwerami za pomocą kolejki komunikatów. Pierwszy serwer w głównej usłudze przejmuje kontrolę nad aplikacją kliencką. Drugi serwer zarządza wysyłaniem wiadomości e-mail. W systemie istnieje uwierzytelnianie i autoryzacja oparte na bezpieczeństwie danych. Wygląd aplikacji internetowej jest nowoczesny, oparty na interaktywnych mapach i komponentach wielokrotnego użytku. Zapewniono również responsywność elementów, dzięki czemu aplikacje mogą być używane na telefonach i tabletach. Projekt został zaprojektowany i wdrożony przeze mnie w ramach mojej pracy inżynierskiej.",
    "masterProject": "Identyfikacja sekwencji DNA w procesie basecallingu na brzegowych klastrach kubernetes",
    "masterProjectDescription": "Eksperymentalna platforma przetwarzania brzegowego, która wykorzystuje wiele modeli sieci neuronowych do identyfikacji zasad DNA/RNA w klastrze urządzeń NVIDIA Jetson Nano. Projekt bada wykonalność, wydajność, efektywność energetyczną i automatyzację wdrażania sygnału nanoporowego (FAST5) → wnioskowania o sekwencji nukleotydowej na obrzeżach sieci, zamiast polegać na scentralizowanych serwerach GPU."
  },
  "professionalExperience": {
    "techStack": "Stack technologiczny",
    "company": "Firma zatrudniająca",
    "period": "Okes zatrudnienia",
    "field": "Dziedzina pracy",
    "currentWorking": "Obecnie pracuję",
    "fullstackDeveloper": "Fullstack web developer",
    "enteField": "Logistka/Transport",
    "enteDescription": "Pracowałem w ENTE Sp. z o.o. jako fullstack web developer, gdzie do moich zadań\nnależało utrzymanie istniejących aplikacji oraz tworzenie zupełnie nowych projektów dla\nklientów. Oprócz typowych aplikacji webowych, brałem również udział w tworzeniu\naplikacji mobilnych. Technologia, w której pracowałem:\nJavaScript/TypeScript(Angular 12+), CSS(PrimeNG, Bootstrap), Java(Spring, Spring\nBoot), ORM (JPA, Hibernate), relacyjne bazy danych (PostgreSQL, MySQL), nierelacyjne\nbazy danych (MongoDB), strumieniowanie danych (Apache Kafka), system kontroli wersji (GitHub,\nGitLab), CI/CD (Jenkins, Groovy), konteneryzacja i hosting (Docker, Kubernetes),\naplikacje mobilne (Ionic). Brałem udział w tworzeniu takich projektów jak:\nsystem GPS do monitorowania pojazdów (AWIA Vehicle), wewnętrzny system do utrzymania\nkolei w całej Polsce (Absynth AWIA), aplikacja mobilna do sterowania zastępczą\nkomunikacją autobusową dla Śląskich Kolei, wewnętrzny system raportowania, aplikacja OLIMP 2.0.",
    "assecoField": "Sektor zdrowotny",
    "assecoDescription": "Należę do niewielkiej grupy osób pracujących w SCRUM, zajmującej się tworzeniem i zarządzaniem aplikacjami internetowymi\ndla sektora opieki zdrowotnej. Stos technologiczny obejmuje: TypeScript (Angular 14+), Java\n11+ z Spring Boot, relacyjne bazy danych w ORACLE, system kontroli wersji (Gitlab),\nCI/CD (Jenkins, TeamCity)."
  },
  "skill": {
    "backend": "Backend",
    "frontend": "Frontend",
    "database": "Bazy danych",
    "cicd": "CI/CD",
    "buildManagement": "Zarządzanie budową",
    "versionControl": "Kontrola wersji",
    "containers": "Konteneryzacja",
    "cloud": "Chmura",
    "mobile": "Technologie mobilne",
    "javascript": "Javascript",
    "typescript": "Typescript",
    "angular": "Angular",
    "html": "HTML",
    "primeng": "PrimeNG",
    "java": "Java",
    "spring": "Spring/Spring Boot",
    "hibernate": "Hibernate / JPA",
    "nestjs": "NestJS",
    "python": "Python",
    "gradle": "Gradle",
    "maven": "Maven",
    "kafka": "Apache Kafka",
    "postgresql": "PostgreSQL",
    "mysql": "MySQL",
    "oracle": "ORACLE",
    "mongodb": "MongoDB",
    "neo4j": "Neo4j",
    "azurecosmosdb": "Azure Cosmos DB",
    "github": "GitHub",
    "gitlab": "GitLab",
    "jenkins": "Jenkins",
    "teamcity": "TeamCity",
    "linux": "Linux",
    "docker": "Docker",
    "kubernetes": "Kubernetes",
    "ionic": "Ionic",
    "capacitor": "Capacitor",
    "aws": "AWS",
    "oci": "Oracle Cloud Infrastructure",
    "agile": "Agile",
    "scrum": "SCRUM",
    "jira": "JIRA"
  },
  "course": {
    "company": "Organizator",
    "date": "Data otrzymania",
    "oracleAiFoundationsAssociate": "Kurs wyjaśnia podstawowe pojęcia z zakresu sztucznej inteligencji, przedstawia\nposzczególne przypadki teoretyczne oraz gotowe rozwiązania w praktyce na platformie chmurowej.",
    "oracleApplicationIntegrationProfessional": "Certyfikat profesjonalny udowadniający szczególną wiedzę z zakresu budowania\nsystemów za pomocą infrastruktury chmurowej przy użyciu interfejsów oraz gotowych\nzooptymalizowanych pod określone przypadki gotowych funkcji",
    "oracleDataPlatformFoundationsAssociate": "Zapoznaje użytkownika z pracą z danymi na platformie OCI. Pokazuje, jak\noptymalnie zarządzać przepływem danych, z jakich gotowych funkcji systemu korzystać, oraz przedstawia\nróżne typy baz danych ORACLE.",
    "oracleCloudInfrastructure": "Kurs Oracle poświęcony dzieleniu się doświadczeniami z zakresu technologii i funkcji chmury obliczeniowej",
    "awsCloudFoundations": "Kurs AWS wprowadzający użytkowników w system chmury i jego funkcje",
    "datacampAwsCloudTechnologyAndService": "Kurs poświęcony technologiom i usługom chmury AWS. Rozwija wiedzę na temat globalnej\ninfrastruktury, strategii wdrażania i łączności, optymalizacji zasobów obliczeniowych,\n zarządzania bazami danych i usługami internetowymi oraz analizy danych i uczenia maszynowego\nw chmurze AWS.",
    "datacampAssociateSql": "Certyfikat potwierdzający znajomość obliczania wskaźników i raportowania charakterystyki danych,\ninterpretacji schematów baz danych, oceny jakości danych, analizowania i czyszczenia danych,\nwydobywania i łączenia agregatów danych przy użyciu języka SQL."
  }
}
